Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་ལ། ཀླུའི་རྒྱལ་པོའི་དབང་པོ་ཐམས་ཅད་ཀྱང་སུ་འབྲང་ཞིང་བྲན་བཞིན་དུ་གནས་པར་འགྱུར་རོ། །
en: One will become a vidyādhara-cakravartin, and all the nāga kings will become one’s followers, acting as servants.

source: བར་གྱི་བསྐལ་པ་སུམ་ཅུར་འཚོ་བར་འགྱུར་རོ། །
en: One will live thirty intermediate eons

source: འདི་རང་དབང་དུའང་སྤྱོད་པར་འགྱུར་རོ། །
en: and will be able to act as one pleases.

source: འགྲོ་བ་ལ་ཐོགས་པ་མེད་པར་འགྱུར་རོ། །
en: One’s activities will be unimpeded.

source: འཕགས་པ་འཇམ་དཔལ་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་རོ། །
en: One will be able to perceive Noble Mañjuśrī face to face.

source: སྤྱི་བོ་ལ་ཕྱག་གིས་རེག་པར་མཛད་དེ། རེག་པ་ཙམ་གྱིས་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་པར་འགྱུར་རོ། །
en: He will touch one on the head, and as soon as he has done so, one will obtain the five superknowledges.

source: ངེས་པར་སངས་རྒྱས་ཉིད་ཀྱང་འཐོབ་པར་འགྱུར་རོ། །
en: One will be certain to attain buddhahood. {10.2}

source: ལས་ཀྱི་མཆོག་གཞན་ཡང་བསྟན་པ་ནི་བིལ་བའི་ཤིང་གཅིག་གི་རང་བཞིན་ལས་གྲུའི་བཞོན་པ་ཤིན་དུ་བརྟན་པ་དང་། ལེགས་པར་བྱས་ཏེ་དེ་ལ་ཞོན་ནས་གང་གཱའི་ཀླུང་ཆེན་པོར་ཞུགས་ཏེབིལ་བའི་ཤིང་ལས་རླུང་ཡོར་བྱས་ཏེ།
en: “There is another supreme ritual practice. One should descend to the bank of the great river Gaṅgā and construct a boat from a single block of wood from the bilva tree. It ought to be well made and attractive. One should board it, bringing an oar of bilva wood.

source: དེ་ཉིད་ཀྱིས་གྲུ་དེ་རླུང་ཡོར་འཛིན་པ་མཁས་པ་གསལ་བ་དེས་ཕྱག་པར་བྱའོ། །
en: With this, one should propel the boat, employing a genuinely skilled assistant.

source: གང་གཱའི་ཀླུང་ཆེན་པོ་མི་དོར་བར་ཡོངས་སུ་ཐད་ཀའམ། ཆུར་ཕྱག་པར་བྱའོ། །
en: One should have him row the boat, without leaving the great river Gaṅgā, in circles, across, or lengthwise.

source: དེ་ནས་གཞན་གང་ཡང་རུང་བའི་སྔགས་རྩ་བའི་སྔགས་སམ། འབྲུ་དྲུག་པའམ། འབྲུ་གསུམ་པའམ། འབྲུ་བརྒྱད་པའམ་འབྲུ་གཅིག་པའམ། ཁྲོ་བོའམ་ཕོ་ཉའམ། འཁོར་གྱི་སྔགས་བཟུང་ནས།
en: One should choose either the six-syllable root mantra, the eight-syllable mantra, the single-syllable one, or another, such as those of the wrathful deities, dūtas, or dūtīs, or yet another mantra.

source: དང་པོར་རས་རིས་ཆེན་པོ་དེ་ཉིད་ནུབ་ཏུ་བལྟས་པས་བཞག་ལ། སྒྲུབ་པ་པོ་ཤར་དུ་བལྟ་བར་བྱའོ། །
en: One should then install the painting of the superior type facing west, with the practitioner facing east.

source: དེ་ནས་ཅི་ལྟར་འདོད་པའི་འོ་མ་དང་། ནས་ཆན་ཁྱོར་གང་ངམ་འབྲས་བུའི་ཁ་ཟས་སམ། ཆུ་དང་རྩ་བ་དང་། འབྲས་བུའི་ཁ་ཟས་ཀྱིས་འཚོ་ལ་མི་སྨྲ་བའི་དཀའ་ཐུབ་དང་། དུས་གསུམ་དུ་ཁྲུས་བྱ་ཞིང་གོས་ལན་གསུམ་བརྗེས་ནས་དགེ་བའི་ལས་བཟང་པོ་ཡང་དག་པར་སྤྱོད་པ་དང་། བློ་དགེ་བ་བཟང་པོ་དང་ལྡན་པའོ། །
en: From this point onward one can conduct the ritual as one wishes. One should use either a dish of milk, barley, and fruit, or one of water, radishes, and fruit. One should observe silence, ritually bathe three times a day, and possess three changes of clothing. One should practice pure conduct, with a very pure mind.

source: དང་པོར་རེ་ཞིག་རས་རིས་ཀྱི་མདུན་དུ་སྔར་ཅི་ལྟར་བསྟན་པའི་སྔར་བཤད་པའི་ཆོ་གས་རིག་པ་འབུམ་ཕྲག་དྲུག་ཅུ་བཟླའོ། །
en: First, one should recite the mantra, in front of the painting, six million times, following the previously described procedure.

source: བཟླས་པ་ཟིན་པ་ན་གྲུ་དེ་རྒྱ་མཚོ་ཆེན་པོར་འགྲོ་བར་འགྱུར་རོ། །
en: Then, at the end of the recitation, the boat will be fit to sail across a big ocean. {10.3}

source: སྒྲུབ་པ་པོའི་ཡོ་བྱད་ཡང་དག་པར་བླངས་ཏེ་སྔར་གྱི་གནས་སུ་གཞག་པར་བྱའོ། །
en: “For that reason, the practitioner should collect the things that he will need and put them in the boat in advance.

source: དེ་ནས་གྲུའི་བཞོན་པ་རྒྱ་མཚོ་ཆེན་པོར་འགྲོ་བ་ན་འཇིགས་པར་མི་བྱ་སྟེ་བཟློག་པར་ཡང་མི་བྱའོ། །
en: He should not be afraid when sailing across the great ocean. The boat will not be obstructed.

source: སྒྲུབ་པ་པོ་མ་གཏོགས་པས་ཟློག་པར་ནུས་པ་ཡང་མ་ཡིན་ནོ། །
en: It cannot be forced to turn back, except through the practitioner’s own will.

source: དེ་ནས་དཔག་ཚད་སྟོང་དུ་གནས་པའི་རྒྱ་མཚོ་ཆེན་པོར་ཡང་ཡུད་ཙམ་གྱིས་འཇུག་པར་འགྱུར་ན།
en: He will thus be able to enter the big ocean in an instant even if this ocean is a thousand leagues away,

source: ལམ་ཐུང་ངུ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: so what need is there even to mention short distances? {10.4}

source: རྒྱ་མཚོ་ཆེན་པོ་དེར་ཕྱིན་པ་ན་སྒྲུབ་པ་པོས་བསྒྲུབ་པའི་ལས་བརྩམ་པར་བྱའོ། །
en: “Having entered it, this home of all rivers, one should start one’s practice.

source: དེ་ནས་སེང་ལྡེང་གི་ཤིང་གི་མེ་སྦར་ལ། སྔར་བྱས་པའི་མེ་ཐབ་བམ། རྫ་མཁན་གྱིས་བྱས་པའི་སའི་སྣོད་ལ། མེ་ཏོག་ནཱ་ག་གེ་སར་ཙནྡན་དཀར་པོ་དང་ག་པུར་གྱིས་བསྲེས་པའི་སྲེག་བླུགས་ཀྱིས་ཤིན་ཏུ་ཉུང་བའམ་རབ་ཏུ་མང་བ་ཡང་རུང་འབུམ་ཕྲག་དྲུག་ཅུ་སྦྱིན་སྲེག་བྱའོ། །
en: Having lit a fire of cutch tree sticks in a previously constructed pit or a clay basin made by a potter, one should offer into the fire six million oblations of stamens of ironwood blossoms mixed with white sandalwood and camphor. These individual oblations could be either small or big. {10.5}

source: སྦྱིན་སྲེག་བྱེད་པ་ན་ཡང་ལང་ཀའི་གྲོང་ཁྱེར་ན་གནས་པའི་སྲིན་པོ་གཟུགས་དང་ཆ་བྱད་མང་པོ་འཛིན་པ་ཧ་ཧ་ཞེས་བྱ་བའི་སྒྲ་སྒྲོགས་པ་དང་།
en: “While one is offering the oblations, the rākṣasas who dwell in Laṅkā and assume many forms will cry, ‘Ha, ha!’

source: ཀླུའི་གྲོང་ཁྱེར་གདེངས་ཀ་དང་ལྡན་པ་ན་གནས་པའི་རྒྱལ་པོ་རྣམས་ལངས་པར་འགྱུར་ཏེཆ་བྱད་རྣམ་པ་སྣ་ཚོགས་འཛིན་པ་རབ་ཏུ་དྲག་པ་དང་། རབ་ཏུ་ཞི་བའི་ཀླུ་དེ་རྣམས་དང་། སྲིན་པོ་དེ་རྣམས་འདི་སྐད་དུ་ཁྱེད་བཞེངས་ཤིག་བཞེངས་ཤིག །བདག་ཅག་གི་བདག་པོ་མཛད་དུ་གསོལ་ཞེས་བརྗོད་དོ། །
en: The nāga kings who dwell in Bhogavatī , a city of the nāga s, will emerge from the water in their different forms, ranging from exceedingly fierce to very peaceful. These nāga s and rākṣasas will say, ‘Get up, sir, get up! Become our master !’

source: དེ་བཞིན་དུ་ལྷ་མ་ཡིན་དང་གནོད་སྦྱིན་དང་། ལྷ་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་གྲུབ་པ་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཆགས་པར་བྱེད་ན་
en: In this way, the asuras, the yakṣa s, the gods, the mahoragas, the celestial siddha s, and all the humans will try to entice the practitioner.

source: ལྡང་བར་མི་བྱ། འཇིགས་པར་མི་བྱའོ། །
en: One should neither get up, nor be afraid. {10.6}

source: དེ་ནས་རིག་པ་འཛིན་པས་སྔགས་ཟློ་ཞིང་། ལག་པ་གཡོན་པའི་མཛུབ་མོས་སྡིགས་མཛུབ་བྱས་ན།
en: “At that time, the adept of vidyās should, while reciting the mantra, threaten them with the index finger of the left hand.

source: དེ་ནས་ཕན་ཚུན་དུ་འགྲོ་བ་དང་འབྱོར་བ་དང་འབྲོས་པར་བྱེད་དོ། །
en: They will then disperse, running hither and thither, and be gone.

source: དེ་ནས་སྦྱིན་སྲེག་ཟིན་པ་ན་གྲུ་དེ་སྒྲུབ་པ་པོ་དེས་བླངས་ན་སྐད་ཅིག་གིས་འོག་མིན་དུ་འགྲོ་བར་འགྱུར་རོ། །
en: Then, at the conclusion of the homa ritual, they will seize the boat together with the practitioner and, in an instant, take it to the realm of Akaniṣṭha .

source: འཇིག་རྟེན་གྱི་ཁམས་གཞན་དུ་ཡང་འགྲོ་བ་དང་འོང་བར་འགྱུར་རོ། །
en: One can thus go to and return from other world spheres.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་མཐུ་མཉམ་པར་འགྱུར།
en: One will become equal in mental power to a bodhisattva,

source: མངོན་པར་ཤེས་པ་ལྔ་དང་རྫུ་འཕྲུལ་ཆེན་པོ་དང་མཐུ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ། །
en: possessing the five superknowledges, great magical abilities, and great power.

source: འདིས་འཕགས་པ་འཇམ་དཔལ་ཡང་རྟག་ཏུ་མཐོང་བར་འགྱུར་རོ། །
en: One will be able to see Noble Mañjuśrī at all times.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་འཕགས་པ་ཉན་ཐོས་མ་གཏོགས་པ། ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་དང་སྲིན་པོ་ཐམས་ཅད་དང་གནོད་སྦྱིན་ཐམས་ཅད་དང་། ལྷ་ཐམས་ཅད་དང་ལྷ་མ་ཡིན་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱང་འདིའི་བཀའ་བཞིན་བྱེད་ཅིང་དབང་དུ་འགྱུར་རོ། །
en: All the nāga s, rākṣasas, gods, asuras, and every other being will come under one’s control, having been appointed to carry out one’s orders by all the buddhas, bodhisattvas, pratyeka­buddhas, noble śrāvakas, and those who have accomplished the mantra.

source: འདིའི་སྔགས་གྲུབ་པ་དེ་དག་ལ་ཡང་བྱམས་པའི་བདག་ཉིད་དུ་འགྱུར་ཞིང་རྗེས་སུ་དགའ་བར་འགྱུར་རོ། །
en: They will be lovingly disposed toward the practitioner and act in his interest,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཐུབ་པའི་བར་དུ་འགྱུར་རོ། །
en: so that he cannot be harmed by any being. {10.7}

source: གཞན་ཡང་ལས་སྒྲུབ་པའི་ཐབས་དམ་པ་ཡོད་དེ།
en: “There is another supreme ritual practice.

source: ཤིང་བིལ་བ་ཆེན་པོ་ལས་གྲུའི་བཞོན་པ་བྱས་ལ་ཡང་ཤིང་གཅིག་གི་ཤིང་གི་ཚོགས་ལས་གནས་ཆེན་པོ་བྱས་ཏེ།
en: One should commission the construction of a boat from a big log of bilva wood, or perhaps from the pieces of a single block of wood.

source: གང་གཱའི་དབུས་ཀྱི་གླིང་དེར་གྲུའི་བཞོན་པའི་གནས་བྱས་ལ།
en: One should construct a big wharf on an island in the middle of the Gaṅgā.

source: དེར་ཡང་གྲུའི་བཞོན་པ་ལ་ཞོན་པའི་སྐྱེས་བུ་བརྒྱ་ཉི་ཤུ་རྣམས་མར་མེ་ལག་ན་ཐོགས་པ།
en: One should build a boat docked at that place. In that boat, there should be one hundred and twenty passengers—each holding a flower and a lamp—

source: གོས་དཀར་པོ་བགོས་པ་སྲུང་བ་བྱས་པ།
en: who have performed the protection rite and are wearing white clothes.

source: ཆོ་ག་སྔ་མས་ཡང་དག་པར་བཞག་པའི་རས་རིས་མདུན་དུ་གཞག་པར་བྱ་སྟེ
en: One should have them place the flowers and the lamps in front of the superior of the different types of painting, installed according to the previously described procedure.

source: དེ་ནས་རས་རིས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ནས།
en: One should then perform a large pūjā in front of the painting

source: ནཱ་ག་གེ་སར་གྱི་ཕྱེ་མ་ཙནྡན་དཀར་པོ་དང་གུར་གུམ་དང་ག་པུར་གྱིས་བསྲེས་པའི་སྲེག་བླུགས་ཀྱིས་སེང་ལྡེང་གི་མེ་ལ་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་སྦྱིན་སྲེག་བྱའོ། །
en: and offer into the cutch-wood fire thirty-six thousand oblations of powdered ironwood blossoms mixed with saffron, white sandalwood, and camphor. {10.8}

source: དེ་ནས་སྦྱིན་སྲེག་ཟིན་པ་ན། སྐད་ཅིག་གིས་ཚངས་པའི་འཇིག་རྟེན་དུ་འགྲོ་བ་དང་འོང་བར་འགྱུར་རོ། །
en: “Subsequently, at the conclusion of the homa ritual, the boat will ascend to the world of Brahmā in an instant.

source: ཅི་ལྟར་འདོད་པ་བཞིན་དུ་རྣམ་པར་རྒྱུ་བར་བྱེད་དོ། །
en: When one arrives there, one will be able to move around at will.

source: འཕགས་པ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་ཏེ།
en: One will perceive Noble Mañjuśrī face to face.

source: མཐོང་བ་ཙམ་གྱིས་ས་ཐོབ་པར་ཡང་འགྱུར་རོ། །
en: As soon as one beholds him, one will attain the bodhisattva levels

source: མངོན་པར་ཤེས་པ་ལྔ་འཐོབ་པ་དང་ཡུན་རིང་དུ་འཚོ་ཞིང་བསྐལ་པ་ཆེན་པོར་གནས་པར་ཡང་འགྱུར་རོ། །
en: and the five superknowledges. One will live for a long time, enduring for one great eon.

source: རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བར་ཡང་འགྱུར་རོ། །
en: One will become the great monarch of the vidyādharas,

source: མར་མེ་འཛིན་པ་དེ་དག་ཀྱང་རིག་པ་འཛིན་པ་འདིའི་གྲོགས་པོར་འགྱུར་ཏེ།
en: who, holding lamps in their hands, will become one’s helpers.

source: དེ་དག་དང་ལྷན་ཅིག་ཅི་ལྟར་འདོད་པ་བཞིན་དུ་རྒྱུ་ཞིང་རང་དབང་དུ་འགྲོ་བར་ཡང་འགྱུར་རོ། །
en: Together with them one will be able to wander as one pleases; one will be able to go wherever one wants to.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་དང་བསྙེན་བཀུར་བྱེད་པར་མངོན་པར་དགའ་བར་འགྱུར་ཞིང་། འཕྲལ་ཡང་སངས་རྒྱས་ཉིད་དུ་ངེས་པར་འགྱུར་རོ། །
en: One will delight in worshiping the blessed buddhas. In the end, one will be certain to attain buddhahood. {10.9}

source: གཞན་ཡང་སྒྲུབ་པའི་ཐབས་ཀྱི་ལས་དམ་པ་ཡོད་དེ།
en: “There is yet another supreme ritual practice.

source: ཆུ་ཀླུང་རྒྱ་མཚོའི་འགྲམ་དག་གམ། །དེ་བཞིན་རི་བོ་ཁ་བ་ཅན། །རི་ཡི་རྒྱལ་པོ་འབིགས་བྱེད་ལ། །ལས་ཀྱི་མཆོག་ནི་བསྒྲུབ་པར་བྱ། །
en: One will accomplish the supreme ritual On a riverbank or an ocean shore, Or also on the snowy mountain— The king of the Vindhya range. {10.10}

source: མ་ལ་ཡ་རི་ས་ཧ་དང་། །སྤོས་ཀྱི་ངད་ལྡང་ཨར་བུ་དང་། །རི་ཡི་རྒྱལ་པོ་སུམ་བརྩེགས་ལ། །ལས་ཀྱི་མཆོག་ནི་བསྒྲུབ་པར་བྱ། །
en: “One will accomplish the supreme ritual In the Sahya mountain range, In Arbuda, or on Gandhamādana Mountain— This three-peaked king of mountains— {10.11}

source: དེ་བཞིན་རྒྱ་མཚོ་ཆེན་པོ་དང་། །རི་ནི་ཤིང་ལྡན་མེ་ཏོག་ཡོད། །
en: “Or similarly, by the great ocean, Or on a mountain rich in trees and flowers.

source: འདི་དག་གི་ནི་ཕྱོགས་དག་ཏུ། །སྔགས་གྲུབ་པར་ནི་རྒྱལ་བས་གསུངས། །
en: It is in these places that the mantras Taught by the victorious ones can be accomplished. {10.12}

source: གཙང་ཞིང་བས་མཐའ་དབེན་ཕྱོགས་སུ། །གྲོང་གི་ཆོས་ནི་རྣམ་པར་སྤངས། །
en: “In a secluded place in the wilderness, Free from the vulgar pursuits of lust,

source: དེ་བཞིན་རི་ཡི་ཚང་ཚིང་དུ། །སྔགས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད་འགྲུབ། །
en: Will the kings of mantras be accomplished— In particular, in inaccessible mountain caves. {10.13}

source: བས་མཐའི་གནས་མལ་ཉམས་དགའ་དང་། །རྒྱལ་བས་དེ་བཞིན་བསྔགས་པ་དང་། །མ་རུངས་སེམས་ཅན་ཐམས་ཅད་ལ། །སྔགས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད་འགྲུབ། །
en: “The kings of mantras will be accomplished In pleasant places of retreat, The ones particularly recommended by the victorious ones, Free from wicked beings. {10.14}

source: ཆོས་ལྡན་རྒྱལ་པོ་ཡོད་པ་དང་། །གཙང་སྦྲ་སྤྱོད་པའི་སྐྱེ་བོ་ཡོད། །
en: “Places where the king is righteous And people follow pure conduct,

source: ཕ་དང་མ་ལ་གུས་པ་དང་། །བྲམ་ཟེའི་རིགས་ནི་ཡོད་པ་ཡི། །
en: Where mothers and fathers are revered, And which are not without the twice born —

source: གནས་དེར་ལྷ་རྣམས་འགྲུབ་འགྱུར་ཏེ། །གཞན་དུ་འགྲུབ་པ་མ་ཡིན་ནོ། །
en: In such places and no others Will the deities grant an accomplishment. {10.15}

source: ཆུ་བོ་གང་གཱའི་འགྲམ་དང་ནི། །དེ་བཞིན་ལེགས་མཛེས་ཡ་མུ་ན། །
en: “On the pleasant bank of the Bhāgīrāthī, Or the bank of the Yamunā, so beautiful,

source: སིནྡུ་ནར་མ་དཱ་ནང་དང་། །ཟླ་བའི་ཆ་ནི་གཙང་ངོགས་དང་། །
en: Or the Indus, the Narmadā, the Oxus, Or the clean bank of the Candrabhāgā, {10.16}

source: དེ་བཞིན་ཀཱ་བའི་ས་ར་སྭད། །ཆུ་བོ་ཆེན་པོ་སཱི་ཏ་རྣམས། །
en: “And also the rivers Kāverī, Sarasvatī, Or the Sitā, this great river of the gods—

source: འདི་དག་གྲུབ་པའི་ཞིང་དུ་ནི། །སྟོབས་བཅུ་ལྡན་སྲས་རྣམས་ཀྱིས་བཤད། །
en: All these have been declared by the sons of those who possess the ten powers To be places of accomplishment. {10.17}

source: སྟོབས་བཅུ་ལྡན་པས་བཤད་པའི་ཞིང་། །བྱང་ཕྱོགས་ཡོད་པའི་རི་དག་དང་། །ཁ་ཆེ་དང་ནི་རྒྱ་ཡུལ་དང་། །བལ་པོ་དེ་བཞིན་མང་ཡུལ་དང་། །
en: “Among the places recommended by the those with the ten powers Are the mountain ranges of the north, Including in Kaśmīra, Tibet, Nepāla, and Kāviśa, {10.18}

source: རྒྱ་ཡུལ་ཆེ་དང་ལི་ཡུལ་དག །དེ་དག་མ་ལུས་གྲུབ་པའི་ཞིང་། །བྱང་ཕྱོགས་ལ་ནི་གནས་པ་དང་། །ནས་དང་གྲོ་ལ་སྤྱོད་པ་དང་། །རི་དང་ཆུ་བོ་དག་ལ་ཡང་། །བསོད་ནམས་ཡུལ་དུ་བསྟན་པ་ཡིན། །
en: “And also all the places in China That bring various accomplishments, And the mountains and streams That are located in northern countries. {10.19} “Countries where people consume wheat and barley Have been declared to be meritorious.

source: སེམས་ཅན་སྙིང་རྗེ་ལྡན་གང་གནས། །དེ་དག་ལ་ནི་ངེས་འགྲུབ་འགྱུར། །
en: Where the inhabitants are compassionate, The accomplishments will certainly be attained. {10.20}

source: དཔལ་གྱི་རི་བོའི་རི་ཆེན་ནི། །ལྷོ་ཡི་ཕྱོགས་ན་ཡང་དག་གནས། །དཔལ་ལྡན་འབྲས་ཕུང་མཆོད་རྟེན་ནི། །རྒྱལ་བའི་རིང་བསྲེལ་གནས་པའི་ས། །
en: “The great mountain, Śrīparvata, Renowned in the Deccan, And the temple in the glorious country of Dhānyakaṭaka, Where the relics of the Victorious One are kept here on earth— {10.21}

source: ཐམས་ཅད་དོན་གྱི་གནས་དག་ལ། །དེར་ནི་སྔགས་རྣམས་མྱུར་དུ་འགྲུབ། །
en: “There the mantras can be swiftly accomplished For the sake of all ritual purposes.

source: མཆོད་རྟེན་ཆེན་པོ་རྡོ་རྗེ་གདན། །ཆོས་ཀྱི་འཁོར་ལོ་རབ་བསྐོར་དང་། །
en: In the great temple of the Vajra Seat, Where the splendid wheel of Dharma has been turned, {10.22}

source: ཐུབ་མཆོག་ཞི་བར་རབ་གཤེགས་པ། །དེར་ཡང་གྲུབ་པར་རབ་ཏུ་སྣང་། །
en: “The supreme sage attained tranquility; There, also, can the accomplishment be seen.

source: ལྷ་ལས་བབས་པའི་མཆོད་རྟེན་དང་། །
en: In the great temple where the Sage descended from the gods’ realm;

source: ནཻ་ཀ་ཤ་དང་ཆོ་འཕྲུལ་བསྟན། །
en: In the country of Saṃkaśya, the place of great miracles; {10.23}

source: གྲོང་མཆོག་སེར་སྐྱ་ཞེས་བྱ་དང་། །
en: “In the great city called Kapilavastu;

source: ནགས་ཚལ་ལུམ་བི་ནིར་འཁྲུངས་ལ། །སྔགས་ཀྱི་རྒྱལ་པོ་འགྲུབ་འགྱུར་ཞེས། །རྒྱལ་བས་རབ་བསྔགས་བརྗོད་པ་ཡིན། །
en: in the best of the forests, Lumbini, Where the most eminent of people [was born]— There the kings of mantras bring accomplishment, In the places praised by the Victorious One. {10.24}

source: བྱ་རྒོད་ཕུང་པོའི་རི་དང་ནི། །དེ་བཞིན་ས་སྟེང་བསིལ་བའི་ཚལ། །
en: “So, too, on Vulture Peak Mountain, Or the place called Śītavana;

source: གྲོང་མཆོག་མེ་ཏོག་ཅེས་བྱ་དང་། །རྟག་ཏུ་དེ་བཞིན་ག་ཤ་དང་། །
en: In the great, pleasant city called Kusuma, And always in Vārāṇasī; {10.25}

source: བཅོམ་བརླག་ཀ་ནྱ་ཀུབ་ཛ་དང་། །ས་སྟེང་གྲོང་ནི་འཕགས་རྒྱལ་དང་། །
en: “In Mathurā, Kanyakubja, Or the city called Ujjain;

source: དེ་བཞིན་ཡངས་པ་ཅན་མཆོད་རྟེན། །མི་ཐི་ལ་ཡི་གྲོང་ཁྱེར་ས། །
en: By the stūpa of Vaiśālī, Or in the place called Mithilā— {10.26}

source: གྲོང་དང་གྲོང་ཁྱེར་མཆོག་དག་ནི། །གང་གཞན་སྐྱེ་བོ་ཡང་དག་འབྱུང་། །
en: “Whatever cities and towns there are, Or other places with human population,

source: རབ་བསྔགས་བསོད་ནམས་ཡུལ་དག་ནི། །དེ་དག་ལ་ནི་བསྒྲུབ་པ་བྱ། །
en: If they are praised as places of merit, Accomplishments will be attained in them. {10.27}

source: དེ་དང་གཞན་ཡང་ཡུལ་དག་དང་། །གྲོང་དང་ལྗོངས་དང་རི་བོར་དང་། །
en: “Living in these and other places— Villages, hamlets, and market towns,

source: གནས་དང་གྲོང་མཆོག་གཙོ་བོ་ནི། །བསོད་ནམས་གནས་ལ་རབ་བརྟེན་ནས། །
en: Fine cities, the best of capitals, Cities located on rivers, rich in merit— {10.28}

source: དེར་ནི་སློང་མོས་རྗེས་འཚོ་ཞིང་། །བཟླས་དང་སྦྱིན་སྲེག་དགའ་བ་དང་། །གནས་ཁང་བླ་གབ་མེད་པ་དང་། །རྟག་ཏུ་ཁྱིམ་ནི་སྟོང་པ་ལ། །
en: “And subsisting there on alms, one should joyfully engage In mantra recitation and homa ritual, Always occupying a place With an open space or empty area. {10.29}

source: སྔགས་རྣམས་ལས་ནི་ཐམས་ཅད་ལ། །ཐོག་མ་ཉིད་དུ་བྱ་བ་ཡིན། །
en: “One should do the preliminary practice Before commencing any mantra rites.

source: སྔགས་པས་རྟག་ཏུ་ཡུལ་དབུས་སུ། །སྔགས་བཟླས་མངོན་པར་འདོད་པས་བྱ། །
en: The mantra practitioner, always in the center, Should recite the mantra with great yearning. {10.30}

source: བཟླས་ལ་རབ་ཞུགས་རྟག་ཏུ་བརྩོན། །
en: “Always engaged in recitation,

source: སྔགས་རིག་གཏོང་བ་དག་ལ་གོམས། །
en: The mantra adept should practice renunciation,

source: ཚུལ་ཁྲིམས་སྤྱོད་ཅིང་ཤིན་ཏུ་དབེན། །
en: Comport himself in a disciplined way, be truthful,

source: འབྱུང་པོ་ཀུན་ལ་ཕན་པར་དགའ། །
en: And delight in doing good for all beings. {10.31}

source: སྔགས་སྤྱོད་པ་ལ་དགའ་བ་ཡི། །སྡོམ་བརྩོན་གྱིས་ནི་སྔགས་བཟླས་བྱ། །
en: “First engendering faith in the mantra practice And keeping one’s observances, one should recite

source: གཙང་ཞིང་གཙང་སྦྲ་ཡོད་ཕྱོགས་དང་། །ཀླ་ཀློ་རྐུན་མ་རྣམ་པར་སྤངས། །
en: In a clean place at a good location, Free from barbarians and thieves— {10.32}

source: སེམས་ཅན་སྡིག་སྦྲུལ་ལ་སོགས་པ། །སྤངས་པའི་ས་ཕྱོགས་འདོད་པ་ཡིས། །འབྲས་བུ་མེ་ཏོག་ཡང་དག་ལྡན། །དྲི་མེད་རབ་བསྔགས་ཆུ་ཡོད་པར། །
en: “A place where there is no harm From any creeping animals, A place abounding in fruits and flowers, Praiseworthy, and supplied with pure water. {10.33}

source: སྔགས་རིགས་སྔགས་ནི་བརྟེན་བྱས་ན། །སྦྱོར་བ་ཐམས་ཅད་རབ་ཏུ་འགྲུབ། །གཞན་ཡང་དུར་ཁྲོད་ཆེན་པོ་ནི། །དེར་ནི་བཟླས་པ་རྟག་ཏུ་བྱ། །
en: “A mantra adept is praised [if he recites] All the mantras in no other places than these. The recommended sites are a temple, A cemetery, or a lonely mountain. {10.34}

source: དྲི་མེད་ཆུ་དང་འབབ་ཆུ་ནི། །སྲོག་ཆགས་དག་ཀྱང་རྣམ་པར་སྤངས། །དེར་ནི་དེ་ཉིད་བཟླ་བྱ་སྟེ། །
en: “A mantra adept also recites all mantras By a solitary lingam, or in a wilderness.

source: མཉམ་པར་བཞག་པས་སྔགས་བཟླས་བྱ། །འཇིག་རྟེན་སྤྱོད་པའི་བསོད་ནམས་མིན། །དེར་ནི་ཅུང་ཟད་མི་མཐོང་སྟེ། །
en: “So, the reciter should always recite the mantra In those places with a focused mind, Because no merit shall be seen By one engaged in the affairs of the world. {10.43}

source: འོན་ཀྱང་སྔགས་ནི་བསྟན་པ་ཡིས། །ཅུང་ཟད་དུས་ནི་བསྟན་པའོ། །
en: “However, for the sake of mantra instructions, One may remain in the world for some time;

source: དེ་ལས་གཞན་དུའང་འགྲོ་བྱ་སྟེ། །
en: Otherwise, one should go elsewhere,

source: དེར་ནི་དམ་ཚིག་ཐོབ་བསྟེན་པ། །ཅུང་ཟད་དུས་ཏེ་གཞན་དུ་མིན། །
en: “Having obtained the samaya, one may remain In the world for a short time, not otherwise.

source: དེ་ནས་གཞན་དུའང་མྱུར་དུ་ནི། །སྔགས་རིག་པས་ནི་ཅི་ནུས་འགྲོ། །བདེ་གཤེགས་མཆོད་རྟེན་བཞུགས་པ་ཡི། །ས་སྟེང་དག་ལ་རྟག་ཏུ་བསྟེན། །
en: Later the adept of mantras should, without delay, Go elsewhere, wherever he is able to. {10.45}

source: འཇིག་རྟེན་མུ་སྟེགས་ཐམས་ཅད་ནི། །ལྟ་བ་ལོག་པར་ལྟུང་བ་དང་། །གཞན་ཡང་སྟེགས་སུ་གྱུར་པ་རྣམས། །སྔགས་རིག་པས་ནི་རྟག་ཏུ་སྤང་། །
en: “He should always dwell in places where there are The dazzling white reliquaries of the tathāgatas, And also all the holy sites in this world Where wrong doctrines are absent— {10.46}

source: རྒྱུ་ངན་འགྲོ་བ་ངན་ཡོད་པར། །སྔགས་རིག་པས་ནི་དེར་མི་བསྟེན། །
en: “The mantra adept should always avoid Other holy sites. An expert in mantras should not dwell in them, As they constitute the cause of bad rebirth. {10.47}

source: གང་དུ་རྒྱལ་བ་མཆོག་བཞུགས་དང་། །ས་སྟེང་བསེ་རུ་རང་རྒྱལ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་སྐལ་བ་ཆེ། །ཉན་ཐོས་རྒྱལ་བའི་སྲས་དག་ནི། །
en: “Instead, he should dwell in those places on earth That have been visited by the best of victors, The rhinoceros-like pratyeka­buddhas, the great bodhisattva beings, The śrāvakas, or the sons of the victorious ones. {10.48}

source: དེ་དག་གནས་པའི་ཕྱོགས་དག་ཏུ། །ཟློས་པ་སྔགས་རིག་ལྡན་པས་བསྟེན། །
en: “The mantra adept, reciting his mantra, Should frequent all these places.

source: འབད་པས་སྔ་མ་ཉིད་དུ་ནི། །གནས་དེ་ལ་ནི་རྟག་ཏུ་སྤྱོད། །
en: In such places he should always practice With great effort as previously explained. {10.49}

source: སྔགས་ཤེས་ཆོ་ག་མཐོང་བ་ཡིས། །ཡང་དང་ཡང་དུ་སྔགས་ཟློས་བྱ། །
en: “Knowing the right procedure, the mantra adept Should recite the mantra ever more,

source: ལུས་ཅན་སྡིག་པ་མ་ལུས་དག །བཟླས་དང་སྦྱིན་སྲེག་དག་གིས་སེལ། །
en: For through the recitation and the homa ritual He will remove all the evil of embodied beings.

source: དེ་བས་འབད་པ་ཀུན་གྱིས་ནི། །མཉམ་བཞག་སྔགས་ནི་བཟླ་བར་བྱ། །
en: He should therefore recite the mantra With all his diligence and a focused mind. {10.50}

source: ལས་ཐམས་ཅད་ལ་གནས་འདི་དག་གསུངས་པ་ལས་སྒྲུབ་པ་མཆོག་གི་ལས་ཀྱི་ཐབས་སྒྲུབ་པ་ལ་གནས་འདི་དག་མ་རྙེད་ན། གང་ཡང་རུང་བའི་གནས་དེ་དག་ཏུ་གཙང་སྦྲ་བྱས་ཏེ་སྔོན་དུ་བསྙེན་པ་བྱས་ལ།
en: “If one does not find, among those places that were taught for all rites, places for the practice of the rites that bring supreme accomplishment, one should perform the preliminary practices in any clean place anywhere.

source: དད་ཅིང་མོས་པས་སྒྲུབ་པའི་ཐབས་ཀྱི་ལམ་དམ་པ་བརྩམ་པར་བྱ་སྟེ།
en: With faith and resolve, one should commence the supreme rites employing the sādhana method. {10.51}

source: དང་པོར་རེ་ཞིག་རས་རིས་ཆེན་པོ་ནུབ་ཏུ་བལྟས་པས་བཞག་སྟེ། བདག་ཉིད་ཤར་དུ་བལྟས་ལ།
en: “To start, one should install the painting of the superior type facing west, with oneself facing east.

source: གྲོག་མཁར་གྱི་སའམ། གང་གཱའི་ཀླུང་གི་ངོགས་ན་ཡོད་པའི་ས་བླངས་ཏེ། རྩྭ་ཨུ་ཤི་ར་དང་ཙནྡན་དཀར་པོ་དང་གུར་གུམ་དང་ག་པུར་ལ་སོགས་པས་བསྲེ་བ་བྱ་སྟེ།
en: One should take some clay, either from a fine anthill or from the bank of the Gaṅgā, and, optionally, [the root of] khaskhas grass, white sandalwood, and saffron.

source: རྨ་བྱའི་གཟུགས་བྱས་ལ་རས་རིས་དེའི་མདུན་དུ་བཞག་གོ། །
en: One should mix this very well with camphor and fashion from this an effigy of a peacock.

source: ཀུ་ཤའི་རྩེ་མོ་མ་ཉམས་པས་ཕྱོགས་གཙང་མར་སྐྱེས་པ་འཁོར་ལོའི་གཟུགས་སུ་བྱས་ཏེ།
en: One should place it in front of the painting and fashion with kuśa grass that has grown in a clean place, with the tips of the grass blades untrimmed, the shape of a ring.

source: རས་རིས་ཀྱི་མདུན་དུ་ལག་པ་གཡས་པས་བཟུང་ཞིང་། ལག་པ་གཡོན་པས་རྨ་བྱ་བཟུང་ལ། ཡར་ངོའི་ཟླ་བ་ཉ་བའི་མཚན་མོར་རས་རིས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ཏེག་པུར་དང་ཙནྡན་གྱི་དུད་པ་བསྲེགས་ལ། ནམ་ལངས་ཀྱི་བར་དུ་བཟླས་པ་བྱས་ན།
en: Holding this ring with one’s right hand in front of the painting, and the peacock with one’s left, one should, on the night of the full moon, offer to the painting a large pūjā, burning an incense of camphor. One should recite the mantra until daybreak. {10.52}

source: དེ་ནས་ཉི་མ་ཤར་བའི་དུས་སུ་ལྷའི་རང་བཞིན་གྱི་རྨ་བྱ་ནི་རྨ་བྱ་ཆེན་པོའི་རྒྱལ་མོར་འགྱུར་རོ། །
en: “Then, at sunrise, this clay peacock will become the great king of peacocks,
